environments/cfd/default_cfd_case/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "combined.fms";

minCellSize 0.2;

maxCellSize 0.2;

boundaryCellSize 0.2;

/*localRefinement
{
    "interior"
    {
        cellSize 0.1;
    }
}*/

// ************************************************************************* //
