environments/cfd/default_cfd_case/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k; // turbulent kinetic energy
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// EXAMPLE CALCULATION (initial turbulence is assumed 5% of inlet velocity)
// 0.05% * 2.5[m/s] = 0.125 [m/s] 
// 3/2 * 0.125^2 = 0.0234 [m^2/s^2]
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0234;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0234;
    }
    
    outlet
    {
        type            zeroGradient; // Von-Neumann Boundary condition
    }
    
    interior
    {
        type            kqRWallFunction;
        value           uniform 0.0234;
    }
    
    sides
    {
        type            kqRWallFunction;
        value           uniform 0.0234;
    }
}


// ************************************************************************* //
